## Plan Result (demo_apim - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 6 to change, 2 to destroy.</code></pre>

* Update
  * module.api-mgmt.azurerm_api_management.apim
  * module.api-mgmt.azurerm_network_security_group.apim
  * module.api-mgmt.azurerm_public_ip.apim
  * module.api-mgmt.azurerm_route_table.route_table
  * module.api-mgmt.module.application_insights.azurerm_application_insights.this
  * module.api-mgmt.module.application_insights.azurerm_monitor_activity_log_alert.main[0]
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "sds-api-mgmt-demo"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "ss-demo-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be updated in-place
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo"
        name                          = "sds-api-mgmt-demo"
      ~ tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
          - "startupMode"  = "always" -> null
        }
        # (22 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo" -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_network_security_group.apim will be updated in-place
  ~ resource "azurerm_network_security_group" "apim" {
        id                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/networkSecurityGroups/sds-api-mgmt-demo-nsg"
        name                = "sds-api-mgmt-demo-nsg"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
          - "startupMode"  = "always" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_public_ip.apim will be updated in-place
  ~ resource "azurerm_public_ip" "apim" {
        id                      = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/publicIPAddresses/sds-api-mgmt-demo-private-pip"
        name                    = "sds-api-mgmt-demo-private-pip"
      ~ tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/sds-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdemo/providers/Microsoft.Authorization/roleAssignments/c7c33dcc-1d06-9dc6-ac3c-e9f62214013e" -> (known after apply)
      ~ name                                   = "c7c33dcc-1d06-9dc6-ac3c-e9f62214013e" -> (known after apply)
      ~ principal_id                           = "bd239398-b9ec-4cd7-8b17-d7dfc8d71547" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_route_table.route_table will be updated in-place
  ~ resource "azurerm_route_table" "route_table" {
        id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/routeTables/sds-api-mgmt-demo-route-table"
        name                          = "sds-api-mgmt-demo-route-table"
      ~ tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.api-mgmt.module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-demo"
        name                                  = "sds-api-mgmt-demo"
      ~ tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
          - "startupMode"  = "always" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # module.api-mgmt.module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - sds-api-mgmt-demo"
        name                = "Application Insights daily cap reached - sds-api-mgmt-demo"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":909,"Program":"tfcmt","SHA1":"","Target":"demo_apim - TerraformPlanApply","Vars":{}} -->